[Killed] BlockStatement
packages/connectors/src/mock.ts:6:72
 
 // CI-friendly, deterministic connector contracts.
 // These are contracts only: execution is simulated by `executeConnectorAction` when session is missing.
-export function buildMockConnectorBundle(): OpenGtmConnectorContract[] {
-  return [
-    createContractForFamily({ provider: 'mock-docs', family: 'docs' }),
-    createContractForFamily({ provider: 'mock-crm', family: 'crm' }),
-    createContractForFamily({ provider: 'mock-enrichment', family: 'enrichment' }),
-    createContractForFamily({ provider: 'mock-web', family: 'web_research' }),
-    createContractForFamily({ provider: 'mock-meetings', family: 'meeting_intelligence' }),
-    createContractForFamily({ provider: 'mock-warehouse', family: 'warehouse' }),
-    createContractForFamily({ provider: 'mock-email', family: 'email' }),
-    createContractForFamily({ provider: 'mock-calendar', family: 'calendar' }),
-    createContractForFamily({ provider: 'mock-comms', family: 'comms' }),
-    createContractForFamily({ provider: 'mock-support', family: 'support' })
-  ]
-}
+export function buildMockConnectorBundle(): OpenGtmConnectorContract[] {}
 
killedBy: connectors: mock bundle includes expected connector families
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] ArrayDeclaration
packages/connectors/src/mock.ts:7:10
 // CI-friendly, deterministic connector contracts.
 // These are contracts only: execution is simulated by `executeConnectorAction` when session is missing.
 export function buildMockConnectorBundle(): OpenGtmConnectorContract[] {
-  return [
-    createContractForFamily({ provider: 'mock-docs', family: 'docs' }),
-    createContractForFamily({ provider: 'mock-crm', family: 'crm' }),
-    createContractForFamily({ provider: 'mock-enrichment', family: 'enrichment' }),
-    createContractForFamily({ provider: 'mock-web', family: 'web_research' }),
-    createContractForFamily({ provider: 'mock-meetings', family: 'meeting_intelligence' }),
-    createContractForFamily({ provider: 'mock-warehouse', family: 'warehouse' }),
-    createContractForFamily({ provider: 'mock-email', family: 'email' }),
-    createContractForFamily({ provider: 'mock-calendar', family: 'calendar' }),
-    createContractForFamily({ provider: 'mock-comms', family: 'comms' }),
-    createContractForFamily({ provider: 'mock-support', family: 'support' })
-  ]
+  return []
 }
 
killedBy: connectors: mock bundle includes expected connector families
statusReason: expected [] to deeply equal ArrayContaining{…}

[Killed] ObjectLiteral
packages/connectors/src/mock.ts:13:29
     createContractForFamily({ provider: 'mock-enrichment', family: 'enrichment' }),
     createContractForFamily({ provider: 'mock-web', family: 'web_research' }),
     createContractForFamily({ provider: 'mock-meetings', family: 'meeting_intelligence' }),
-    createContractForFamily({ provider: 'mock-warehouse', family: 'warehouse' }),
+    createContractForFamily({}),
     createContractForFamily({ provider: 'mock-email', family: 'email' }),
     createContractForFamily({ provider: 'mock-calendar', family: 'calendar' }),
killedBy: connectors: mock bundle includes expected connector families
statusReason: Cannot read properties of undefined (reading 'trim')
