[Killed] ArrayDeclaration
packages/skills/src/manifest-v2.ts:4:28
 import type { SkillManifest, SkillArtifact } from './types.js'
 
 export function validateSkillManifest(m: SkillManifest): string[] {
-  const errors: string[] = []
+  const errors: string[] = ["Stryker was here"]
   if (!m.id || !/^[a-z][a-z0-9_]*$/.test(m.id)) {
     errors.push('id must be lowercase snake_case')
killedBy: skills: executor binding binds required connectors and reports missing ones
statusReason: Invalid skill manifest "lead_research": Stryker was here

[Killed] BooleanLiteral
packages/skills/src/manifest-v2.ts:5:7
 
 export function validateSkillManifest(m: SkillManifest): string[] {
   const errors: string[] = []
-  if (!m.id || !/^[a-z][a-z0-9_]*$/.test(m.id)) {
+  if (m.id || !/^[a-z][a-z0-9_]*$/.test(m.id)) {
     errors.push('id must be lowercase snake_case')
   }
killedBy: skills: registry-v2 supports add/get/list/disclose/match flows
statusReason: Invalid skill manifest "lead_research": id must be lowercase snake_case

[Killed] LogicalOperator
packages/skills/src/manifest-v2.ts:5:7
 
 export function validateSkillManifest(m: SkillManifest): string[] {
   const errors: string[] = []
-  if (!m.id || !/^[a-z][a-z0-9_]*$/.test(m.id)) {
+  if (!m.id && !/^[a-z][a-z0-9_]*$/.test(m.id)) {
     errors.push('id must be lowercase snake_case')
   }
killedBy: skills: manifest-v2 reports structural validation errors
statusReason: expected [ …(5) ] to deeply equal [ …(6) ]

[Killed] ConditionalExpression
packages/skills/src/manifest-v2.ts:8:7
   if (!m.id || !/^[a-z][a-z0-9_]*$/.test(m.id)) {
     errors.push('id must be lowercase snake_case')
   }
-  if (!m.name) errors.push('name is required')
+  if (true) errors.push('name is required')
   if (!m.version || !/^\d+\.\d+\.\d+$/.test(m.version)) {
     errors.push('version must be semver MAJOR.MINOR.PATCH')
killedBy: skills: executor binding binds required connectors and reports missing ones
statusReason: Invalid skill manifest "lead_research": name is required

[Killed] BooleanLiteral
packages/skills/src/manifest-v2.ts:8:7
   if (!m.id || !/^[a-z][a-z0-9_]*$/.test(m.id)) {
     errors.push('id must be lowercase snake_case')
   }
-  if (!m.name) errors.push('name is required')
+  if (m.name) errors.push('name is required')
   if (!m.version || !/^\d+\.\d+\.\d+$/.test(m.version)) {
     errors.push('version must be semver MAJOR.MINOR.PATCH')
killedBy: skills: registry-v2 supports add/get/list/disclose/match flows
statusReason: Invalid skill manifest "lead_research": name is required

[Killed] BooleanLiteral
packages/skills/src/manifest-v2.ts:9:21
     errors.push('id must be lowercase snake_case')
   }
   if (!m.name) errors.push('name is required')
-  if (!m.version || !/^\d+\.\d+\.\d+$/.test(m.version)) {
+  if (!m.version || /^\d+\.\d+\.\d+$/.test(m.version)) {
     errors.push('version must be semver MAJOR.MINOR.PATCH')
   }
killedBy: skills: executor binding binds required connectors and reports missing ones
statusReason: Invalid skill manifest "lead_research": version must be semver MAJOR.MINOR.PATCH

[Killed] ConditionalExpression
packages/skills/src/manifest-v2.ts:9:7
     errors.push('id must be lowercase snake_case')
   }
   if (!m.name) errors.push('name is required')
-  if (!m.version || !/^\d+\.\d+\.\d+$/.test(m.version)) {
+  if (false) {
     errors.push('version must be semver MAJOR.MINOR.PATCH')
   }
killedBy: skills: manifest-v2 reports structural validation errors
statusReason: expected [ …(5) ] to deeply equal [ …(6) ]

[Killed] BlockStatement
packages/skills/src/manifest-v2.ts:12:64
   if (!m.version || !/^\d+\.\d+\.\d+$/.test(m.version)) {
     errors.push('version must be semver MAJOR.MINOR.PATCH')
   }
-  if (!['SDR', 'AE', 'CS', 'DE', 'cross'].includes(m.persona)) {
-    errors.push(`persona must be one of SDR|AE|CS|DE|cross (got ${m.persona})`)
-  }
+  if (!['SDR', 'AE', 'CS', 'DE', 'cross'].includes(m.persona)) {}
   if (!m.summary || m.summary.length < 10) {
     errors.push('summary must be at least 10 characters')
killedBy: skills: manifest-v2 reports structural validation errors
statusReason: expected [ …(5) ] to deeply equal [ …(6) ]

[Killed] BooleanLiteral
packages/skills/src/manifest-v2.ts:12:7
   if (!m.version || !/^\d+\.\d+\.\d+$/.test(m.version)) {
     errors.push('version must be semver MAJOR.MINOR.PATCH')
   }
-  if (!['SDR', 'AE', 'CS', 'DE', 'cross'].includes(m.persona)) {
+  if (['SDR', 'AE', 'CS', 'DE', 'cross'].includes(m.persona)) {
     errors.push(`persona must be one of SDR|AE|CS|DE|cross (got ${m.persona})`)
   }
killedBy: skills: catalog loads the 18-skill GTM catalog with valid manifests
statusReason: Invalid skill manifest "lead_research": persona must be one of SDR|AE|CS|DE|cross (got SDR)

[Killed] LogicalOperator
packages/skills/src/manifest-v2.ts:15:7
   if (!['SDR', 'AE', 'CS', 'DE', 'cross'].includes(m.persona)) {
     errors.push(`persona must be one of SDR|AE|CS|DE|cross (got ${m.persona})`)
   }
-  if (!m.summary || m.summary.length < 10) {
+  if (!m.summary && m.summary.length < 10) {
     errors.push('summary must be at least 10 characters')
   }
killedBy: skills: manifest-v2 reports structural validation errors
statusReason: expected [ …(5) ] to deeply equal [ …(6) ]

[Killed] BlockStatement
packages/skills/src/manifest-v2.ts:15:44
   if (!['SDR', 'AE', 'CS', 'DE', 'cross'].includes(m.persona)) {
     errors.push(`persona must be one of SDR|AE|CS|DE|cross (got ${m.persona})`)
   }
-  if (!m.summary || m.summary.length < 10) {
-    errors.push('summary must be at least 10 characters')
-  }
+  if (!m.summary || m.summary.length < 10) {}
   if (!Array.isArray(m.steps) || m.steps.length === 0) {
     errors.push('steps must be non-empty')
killedBy: skills: manifest-v2 reports structural validation errors
statusReason: expected [ …(5) ] to deeply equal [ …(6) ]

[Killed] ConditionalExpression
packages/skills/src/manifest-v2.ts:18:34
   if (!m.summary || m.summary.length < 10) {
     errors.push('summary must be at least 10 characters')
   }
-  if (!Array.isArray(m.steps) || m.steps.length === 0) {
+  if (!Array.isArray(m.steps) || false) {
     errors.push('steps must be non-empty')
   } else {
killedBy: skills: manifest-v2 throws when building an artifact from an invalid manifest
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
packages/skills/src/manifest-v2.ts:18:7
   if (!m.summary || m.summary.length < 10) {
     errors.push('summary must be at least 10 characters')
   }
-  if (!Array.isArray(m.steps) || m.steps.length === 0) {
+  if (Array.isArray(m.steps) || m.steps.length === 0) {
     errors.push('steps must be non-empty')
   } else {
killedBy: skills: manifest-v2 validates a well-formed manifest
statusReason: expected [ 'steps must be non-empty' ] to deeply equal []

[Killed] BlockStatement
packages/skills/src/manifest-v2.ts:20:10
   }
   if (!Array.isArray(m.steps) || m.steps.length === 0) {
     errors.push('steps must be non-empty')
-  } else {
-    const ids = new Set<string>()
-    for (const step of m.steps) {
-      if (!step.id) errors.push('each step requires an id')
-      if (ids.has(step.id)) errors.push(`duplicate step id: ${step.id}`)
-      ids.add(step.id)
-    }
-  }
+  } else {}
   return errors
 }
killedBy: skills: manifest-v2 reports structural validation errors
statusReason: expected [ …(4) ] to deeply equal [ …(6) ]

[Killed] BlockStatement
packages/skills/src/manifest-v2.ts:22:33
     errors.push('steps must be non-empty')
   } else {
     const ids = new Set<string>()
-    for (const step of m.steps) {
-      if (!step.id) errors.push('each step requires an id')
-      if (ids.has(step.id)) errors.push(`duplicate step id: ${step.id}`)
-      ids.add(step.id)
-    }
+    for (const step of m.steps) {}
   }
   return errors
killedBy: skills: manifest-v2 reports structural validation errors
statusReason: expected [ …(4) ] to deeply equal [ …(6) ]

[Killed] BooleanLiteral
packages/skills/src/manifest-v2.ts:23:11
   } else {
     const ids = new Set<string>()
     for (const step of m.steps) {
-      if (!step.id) errors.push('each step requires an id')
+      if (step.id) errors.push('each step requires an id')
       if (ids.has(step.id)) errors.push(`duplicate step id: ${step.id}`)
       ids.add(step.id)
killedBy: skills: manifest-v2 validates a well-formed manifest
statusReason: expected [ 'each step requires an id' ] to deeply equal []

[Killed] ConditionalExpression
packages/skills/src/manifest-v2.ts:23:11
   } else {
     const ids = new Set<string>()
     for (const step of m.steps) {
-      if (!step.id) errors.push('each step requires an id')
+      if (true) errors.push('each step requires an id')
       if (ids.has(step.id)) errors.push(`duplicate step id: ${step.id}`)
       ids.add(step.id)
killedBy: skills: manifest-v2 validates a well-formed manifest
statusReason: expected [ 'each step requires an id' ] to deeply equal []

[Killed] ConditionalExpression
packages/skills/src/manifest-v2.ts:24:11
     const ids = new Set<string>()
     for (const step of m.steps) {
       if (!step.id) errors.push('each step requires an id')
-      if (ids.has(step.id)) errors.push(`duplicate step id: ${step.id}`)
+      if (false) errors.push(`duplicate step id: ${step.id}`)
       ids.add(step.id)
     }
killedBy: skills: manifest-v2 reports structural validation errors
statusReason: expected [ …(5) ] to deeply equal [ …(6) ]

[Killed] ConditionalExpression
packages/skills/src/manifest-v2.ts:24:11
     const ids = new Set<string>()
     for (const step of m.steps) {
       if (!step.id) errors.push('each step requires an id')
-      if (ids.has(step.id)) errors.push(`duplicate step id: ${step.id}`)
+      if (true) errors.push(`duplicate step id: ${step.id}`)
       ids.add(step.id)
     }
killedBy: skills: manifest-v2 validates a well-formed manifest
statusReason: expected [ 'duplicate step id: load' ] to deeply equal []

[Killed] BlockStatement
packages/skills/src/manifest-v2.ts:31:97
   return errors
 }
 
-export function makeSkillArtifact(manifest: SkillManifest, contentPath?: string): SkillArtifact {
-  const errors = validateSkillManifest(manifest)
-  if (errors.length > 0) {
-    throw new Error(
-      `Invalid skill manifest "${manifest.id || '<unknown>'}": ${errors.join('; ')}`
-    )
-  }
-  return { manifest, contentPath }
-}
+export function makeSkillArtifact(manifest: SkillManifest, contentPath?: string): SkillArtifact {}
 
killedBy: skills: manifest-v2 creates an artifact with optional content path
statusReason: expected undefined to deeply equal { manifest: { …(13) }, …(1) }

[Killed] ConditionalExpression
packages/skills/src/manifest-v2.ts:33:7
 
 export function makeSkillArtifact(manifest: SkillManifest, contentPath?: string): SkillArtifact {
   const errors = validateSkillManifest(manifest)
-  if (errors.length > 0) {
+  if (true) {
     throw new Error(
       `Invalid skill manifest "${manifest.id || '<unknown>'}": ${errors.join('; ')}`
killedBy: skills: registry-v2 supports add/get/list/disclose/match flows
statusReason: Invalid skill manifest "lead_research":

[Killed] ConditionalExpression
packages/skills/src/manifest-v2.ts:33:7
 
 export function makeSkillArtifact(manifest: SkillManifest, contentPath?: string): SkillArtifact {
   const errors = validateSkillManifest(manifest)
-  if (errors.length > 0) {
+  if (false) {
     throw new Error(
       `Invalid skill manifest "${manifest.id || '<unknown>'}": ${errors.join('; ')}`
killedBy: skills: manifest-v2 throws when building an artifact from an invalid manifest
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
packages/skills/src/manifest-v2.ts:35:34
   const errors = validateSkillManifest(manifest)
   if (errors.length > 0) {
     throw new Error(
-      `Invalid skill manifest "${manifest.id || '<unknown>'}": ${errors.join('; ')}`
+      `Invalid skill manifest "${true}": ${errors.join('; ')}`
     )
   }
killedBy: skills: manifest-v2 throws when building an artifact from an invalid manifest
statusReason: expected [Function] to throw error including 'Invalid skill manifest "lead_research…' but got 'Invalid skill manifest "true": steps …'

[Killed] ConditionalExpression
packages/skills/src/manifest-v2.ts:35:34
   const errors = validateSkillManifest(manifest)
   if (errors.length > 0) {
     throw new Error(
-      `Invalid skill manifest "${manifest.id || '<unknown>'}": ${errors.join('; ')}`
+      `Invalid skill manifest "${false}": ${errors.join('; ')}`
     )
   }
killedBy: skills: manifest-v2 throws when building an artifact from an invalid manifest
statusReason: expected [Function] to throw error including 'Invalid skill manifest "lead_research…' but got 'Invalid skill manifest "false": steps…'
