[Killed] BlockStatement
packages/storage/src/paths.ts:4:74
 import path from 'node:path'
 import type { OpenGtmStoragePaths } from './types.js'
 
-export function createStoragePaths(rootDir: string): OpenGtmStoragePaths {
-  return {
-    rootDir,
-    artifactsDir: path.join(rootDir, 'artifacts'),
-    databasePath: path.join(rootDir, 'opengtm.sqlite')
-  }
-}
+export function createStoragePaths(rootDir: string): OpenGtmStoragePaths {}
killedBy: storage lifecycle compacts working memory per scope
statusReason: Cannot read properties of undefined (reading 'rootDir')
