[Killed] BlockStatement
packages/skills/src/executor-binding.ts:18:23
 export function bindSkillToConnectors(
   artifact: SkillArtifact,
   connectors: ConnectorDescriptor[]
-): SkillBindingResult {
-  const satisfied: SkillRequiredConnector[] = []
-  const missing: SkillRequiredConnector[] = []
-
-  for (const req of artifact.manifest.requiredConnectors) {
-    const connector = connectors.find((c) => c.family === req.family)
-    if (connector && connector.capabilities.includes(req.capability)) {
-      satisfied.push(req)
-    } else {
-      missing.push(req)
-    }
-  }
-
-  return {
-    skillId: artifact.manifest.id,
-    bound: missing.length === 0,
-    satisfied,
-    missing
-  }
-}
+): SkillBindingResult {}
 
 export function filterRunnableSkills(
killedBy: skills: executor binding binds required connectors and reports missing ones
statusReason: expected undefined to deeply equal { skillId: 'lead_research', …(3) }

[Killed] BlockStatement
packages/skills/src/executor-binding.ts:22:59
   const satisfied: SkillRequiredConnector[] = []
   const missing: SkillRequiredConnector[] = []
 
-  for (const req of artifact.manifest.requiredConnectors) {
-    const connector = connectors.find((c) => c.family === req.family)
-    if (connector && connector.capabilities.includes(req.capability)) {
-      satisfied.push(req)
-    } else {
-      missing.push(req)
-    }
-  }
+  for (const req of artifact.manifest.requiredConnectors) {}
 
   return {
killedBy: skills: executor binding binds required connectors and reports missing ones
statusReason: expected { skillId: 'lead_research', …(3) } to deeply equal { skillId: 'lead_research', …(3) }

[Killed] ConditionalExpression
packages/skills/src/executor-binding.ts:23:46
   const missing: SkillRequiredConnector[] = []
 
   for (const req of artifact.manifest.requiredConnectors) {
-    const connector = connectors.find((c) => c.family === req.family)
+    const connector = connectors.find((c) => false)
     if (connector && connector.capabilities.includes(req.capability)) {
       satisfied.push(req)
killedBy: skills: executor binding binds required connectors and reports missing ones
statusReason: expected { skillId: 'lead_research', …(3) } to deeply equal { skillId: 'lead_research', …(3) }

[Killed] ArrowFunction
packages/skills/src/executor-binding.ts:23:39
   const missing: SkillRequiredConnector[] = []
 
   for (const req of artifact.manifest.requiredConnectors) {
-    const connector = connectors.find((c) => c.family === req.family)
+    const connector = connectors.find(() => undefined)
     if (connector && connector.capabilities.includes(req.capability)) {
       satisfied.push(req)
killedBy: skills: executor binding binds required connectors and reports missing ones
statusReason: expected { skillId: 'lead_research', …(3) } to deeply equal { skillId: 'lead_research', …(3) }

[Killed] ConditionalExpression
packages/skills/src/executor-binding.ts:24:9
 
   for (const req of artifact.manifest.requiredConnectors) {
     const connector = connectors.find((c) => c.family === req.family)
-    if (connector && connector.capabilities.includes(req.capability)) {
+    if (true) {
       satisfied.push(req)
     } else {
killedBy: skills: executor binding binds required connectors and reports missing ones
statusReason: expected { skillId: 'lead_research', …(3) } to deeply equal { skillId: 'lead_research', …(3) }

[Killed] ConditionalExpression
packages/skills/src/executor-binding.ts:24:9
 
   for (const req of artifact.manifest.requiredConnectors) {
     const connector = connectors.find((c) => c.family === req.family)
-    if (connector && connector.capabilities.includes(req.capability)) {
+    if (false) {
       satisfied.push(req)
     } else {
killedBy: skills: executor binding binds required connectors and reports missing ones
statusReason: expected { skillId: 'lead_research', …(3) } to deeply equal { skillId: 'lead_research', …(3) }

[Killed] BlockStatement
packages/skills/src/executor-binding.ts:26:12
     const connector = connectors.find((c) => c.family === req.family)
     if (connector && connector.capabilities.includes(req.capability)) {
       satisfied.push(req)
-    } else {
-      missing.push(req)
-    }
+    } else {}
   }
 
killedBy: skills: executor binding binds required connectors and reports missing ones
statusReason: expected { skillId: 'lead_research', …(3) } to deeply equal { skillId: 'lead_research', …(3) }

[Killed] ConditionalExpression
packages/skills/src/executor-binding.ts:33:12
 
   return {
     skillId: artifact.manifest.id,
-    bound: missing.length === 0,
+    bound: false,
     satisfied,
     missing
killedBy: skills: executor binding filters runnable skills to fully satisfied artifacts only
statusReason: expected [] to deeply equal [ 'lead_research' ]

[Killed] ConditionalExpression
packages/skills/src/executor-binding.ts:33:12
 
   return {
     skillId: artifact.manifest.id,
-    bound: missing.length === 0,
+    bound: true,
     satisfied,
     missing
killedBy: skills: executor binding binds required connectors and reports missing ones
statusReason: expected { skillId: 'lead_research', …(3) } to deeply equal { skillId: 'lead_research', …(3) }

[Killed] BlockStatement
packages/skills/src/executor-binding.ts:42:20
 export function filterRunnableSkills(
   artifacts: SkillArtifact[],
   connectors: ConnectorDescriptor[]
-): SkillArtifact[] {
-  return artifacts.filter((a) => bindSkillToConnectors(a, connectors).bound)
-}
+): SkillArtifact[] {}
 
killedBy: skills: executor binding filters runnable skills to fully satisfied artifacts only
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] MethodExpression
packages/skills/src/executor-binding.ts:43:10
   artifacts: SkillArtifact[],
   connectors: ConnectorDescriptor[]
 ): SkillArtifact[] {
-  return artifacts.filter((a) => bindSkillToConnectors(a, connectors).bound)
+  return artifacts
 }
 
killedBy: skills: executor binding filters runnable skills to fully satisfied artifacts only
statusReason: expected [ 'lead_research', 'account_brief' ] to deeply equal [ 'lead_research' ]

[Killed] ArrowFunction
packages/skills/src/executor-binding.ts:43:27
   artifacts: SkillArtifact[],
   connectors: ConnectorDescriptor[]
 ): SkillArtifact[] {
-  return artifacts.filter((a) => bindSkillToConnectors(a, connectors).bound)
+  return artifacts.filter(() => undefined)
 }
 
killedBy: skills: executor binding filters runnable skills to fully satisfied artifacts only
statusReason: expected [] to deeply equal [ 'lead_research' ]
